#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.satire_bot.heroku_app.satire_bot: Refreshing state... [id=7e60720e-8192-4576-893c-25f2000da1c6]
module.satire_bot.heroku_build.satire_bot: Refreshing state... [id=a14900ee-3eb5-41b3-a8f7-ffb6cfa93417]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.satire_bot.heroku_build.satire_bot has changed
  ~ resource "heroku_build" "satire_bot" {
        id                = "a14900ee-3eb5-41b3-a8f7-ffb6cfa93417"
      ~ output_stream_url = "https://build-output.heroku.com/streams/7e/7e60720e-8192-4576-893c-25f2000da1c6/logs/a1/a14900ee-3eb5-41b3-a8f7-ffb6cfa93417.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220402%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220402T194324Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=e25afee45ccdbbf61f8c3b25c2a2d853792ea40c5fd005e3d74bb744c4026dc0" -> "https://build-output.heroku.com/streams/7e/7e60720e-8192-4576-893c-25f2000da1c6/logs/a1/a14900ee-3eb5-41b3-a8f7-ffb6cfa93417.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220402%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220402T204711Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=c187514ddc2a5d16743f71993567932dc50f46e42b282de605948569e8fac9b7"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.satire_bot.heroku_build.satire_bot must be replaced
-/+ resource "heroku_build" "satire_bot" {
      ~ buildpacks        = [
          - "https://buildpack-registry.s3.amazonaws.com/buildpacks/heroku/go.tgz",
        ] -> (known after apply)
      ~ id                = "a14900ee-3eb5-41b3-a8f7-ffb6cfa93417" -> (known after apply)
      ~ local_checksum    = "SHA256:0278eb9c6f3d45551918cd75e7ff8fd7135a736d1c6a52898637ed99189e297b" -> "SHA256:e107b8d50c34ba92945b120ddff580a09dd2ef1cdbb2923d5f7b61829954eda6" # forces replacement
      ~ output_stream_url = "https://build-output.heroku.com/streams/7e/7e60720e-8192-4576-893c-25f2000da1c6/logs/a1/a14900ee-3eb5-41b3-a8f7-ffb6cfa93417.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220402%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220402T204711Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=c187514ddc2a5d16743f71993567932dc50f46e42b282de605948569e8fac9b7" -> (known after apply)
      ~ release_id        = "6f7dee7f-270f-4d43-b071-6101cc06322b" -> (known after apply)
      ~ slug_id           = "e7003685-9061-4954-a4be-fcd7e076956b" -> (known after apply)
      ~ stack             = "heroku-20" -> (known after apply)
      ~ status            = "succeeded" -> (known after apply)
      ~ user              = [
          - {
              - email = "lucasyharada@gmail.com"
              - id    = "a3800f25-eaa7-417d-9b9d-5f3b7953685e"
            },
        ] -> (known after apply)
      ~ uuid              = "a14900ee-3eb5-41b3-a8f7-ffb6cfa93417" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ source {
          + checksum = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Adarah, Action: `pull_request`, Working Directory: `infrastructure`, Workflow: `Verify`*